{"input": "What is the ASCII code of the last letter of the first name of the current drummer of the band who did the song \"What Lovers Do\"?", "target": "116", "metadata": {"subquestions": ["Which band did the song \"What Lovers Do\"?", "Who is the current drummer of Maroon 5?", "What is the ASCII code of the last letter of the first name of Matt Flynn?"], "supporting_facts": ["Maroon 5", "Matt Flynn", "116"], "context": "Maroon 5 is an American pop rock band that originated in Los Angeles, California.  It currently consists of lead vocalist Adam Levine, keyboardist and rhythm guitarist Jesse Carmichael, bassist Mickey Madden, lead guitarist James Valentine, drummer Matt Flynn and keyboardist PJ Morton. \"What Lovers Do\" is a song by American pop rock band Maroon 5 featuring American R&B singer Sza.  It was released on August 30, 2017, as the third single from the band's upcoming sixth studio album (2017).  The song contains an interpolation of the 2016 song \"Sexual\" by Neiked featuring Dyo, therefore Victor Rådström, Dyo and Elina Stridh are credited as songwriters.", "reasoning_type": "Symbolic, Commonsense"}}
{"input": "How many fewer letters does the first name of Myra Bailey have compared to the first name of the paternal grandfather of Euphemia Ii, Countess Of Ross?", "target": "2", "metadata": {"subquestions": ["Who is the father of Euphemia Ii, Countess Of Ross?", "Who is the father of Alexander Leslie, Earl Of Ross?", "How many fewer letters does the first name of Myra Bailey have compared to the first name of Walter Leslie?"], "supporting_facts": ["Alexander Leslie", "Walter Leslie", "2"], "context": "Alexander Leslie, Earl of Ross( died 1402) was a Scottish nobleman. Born between 1367 and 1382, he was the son of Walter Leslie, Lord of Ross and Euphemia I, Countess of Ross. In around 1394 he became Earl of Ross and sometime before 1398 he married Isabel Stewart, daughter of Robert Stewart, Duke of Albany. They had one child, Euphemia. He died at Dingwall, Scotland on 8 May 1402. Euphemia II, Countess of Ross( also Euphemia Leslie) was the daughter of Alexander Leslie, Earl of Ross and his wife Isabella Stewart, daughter of Robert Stewart, 1st Duke of Albany. She was the only child and heir of Earl Alexander, and succeeded to the earldom\" de jure\" upon his death in 1402. She became a ward of her grandfather Albany, and never seems to have exercised much power in the province of Ross. There was a failed attempt to marry her to Thomas Dunbar, the son of Thomas Dunbar, Earl of Moray. Governor Albany persuaded her to resign the earldom to his own second son, John Stewart, Earl of Buchan. This action was challenged by Domhnall of Islay, Lord of the Isles, who claimed the earldom on behalf of his wife Mariota and who became an enemy of the Albany Stewarts. Euphemia thereafter disappears from the record, retiring to the nunnery of North Berwick. Some of the histories report that she was deformed, seemingly a hunchback.", "reasoning_type": "Commonsense, Arithmetic"}}
{"input": "What is the result of substracting 8 from the reverse of when the publisher of Qst was founded?", "target": "4183", "metadata": {"subquestions": ["Who is the publisher of Qst?", "When was American Radio Relay League founded?", "What is the result of substracting 8 from the reverse of 1914?"], "supporting_facts": ["American Radio Relay League", "1914", "4183"], "context": "The American Radio Relay League (ARRL) is the largest membership association of amateur radio enthusiasts in the USA. ARRL is a non-profit organization, and was co-founded on April 6, 1914 by Hiram Percy Maxim and Clarence D. Tuska of Hartford, Connecticut. The ARRL represents the interests of amateur radio operators before federal regulatory bodies, provides technical advice and assistance to amateur radio enthusiasts, supports a number of educational programs and sponsors emergency communications service throughout the country. The ARRL has approximately 154,000 members. In addition to members in the US, the organization claims over 7,000 members in other countries. The ARRL publishes many books and a monthly membership journal called \"QST\". The ARRL held its Centennial Convention in Hartford, Connecticut in July 2014. The ARRL is the primary representative organization of amateur radio operators to the US government. It performs this function by lobbying the US Congress and the Federal Communications Commission. The ARRL is also the international secretariat of the International Amateur Radio Union, which performs a similar role internationally, advocating for amateur radio interests before the International Telecommunications Union and the World Administrative Radio Conferences. The organization is governed by a member-elected, volunteer Board of Directors. Each director serves a three-year term and represents the members within their particular region of the country. The national headquarters facilities are located in Newington, Connecticut. Along with the administrative headquarters, the site is home to amateur radio station W1AW. The ARRL Field Organization carries out local and regional activities across the United States. QST  is a magazine for amateur radio enthusiasts, published by the American Radio Relay League (ARRL). It is a membership journal that is included with membership in the ARRL. The publisher claims that circulation of \"QST\" in the United States is higher than all other amateur radio-related publications in the United States combined. Although an exact number for circulation is not published by the American Radio Relay League, the organization claimed 154,627 members at the end of 2008, almost all of whom receive the magazine monthly, in addition to issues delivered to libraries and newsstands. The magazine name is derived from the radio Q signal meaning \"calling all stations\", and its first issue was dated December 1915. \"QST\" suspended publication after September 1917 due to World War One, but has been continuously published since its resumption in May 1919. Supplemental content to the magazine is available on the ARRL web site, including a complete archive in PDF format, available to ARRL members starting in 2008.", "reasoning_type": "Symbolic, Arithmetic"}}
{"input": "What are the initials of the name of the place where the author of Hannibal and Scipio was educated?", "target": "EC", "metadata": {"subquestions": ["Who is the author of Hannibal And Scipio?", "Where did  Thomas Nabbes study?", "What are the initials of the place Exeter College?"], "supporting_facts": ["Thomas Nabbes", "Exeter College", "EC"], "context": "He was born in humble circumstances in Worcestershire, and educated at Exeter College, Oxford in 1621. He left the university without taking a degree, and in about 1630 began a career in London as a dramatist. He was employed at some point in the household of a nobleman near Worcester, and seems to have been of a convivial disposition. He had at least two children, Bridget and William, both of whom died within two years of his death, and were buried with him at St Giles in the Fields. Hannibal and Scipio is a Caroline era stage play, a classical tragedy written by Thomas Nabbes. The play was first performed in 1635 by Queen Henrietta's Men, and was first published in 1637. The first edition of the play contained a cast list of the original production, making the 1637 quarto an important information source on English Renaissance theatre.", "reasoning_type": "Symbolic"}}
{"input": "What is the sum of the (unique) prime factors of when the publisher of Bellingham Review was founded?", "target": "634", "metadata": {"subquestions": ["Who is the publisher of Bellingham Review?", "When was Western Washington University founded?", "What is the sum of the (unique) prime factors of 1893?"], "supporting_facts": ["Western Washington University", "1893", "634"], "context": "The Bellingham Review is an American literary magazine published by Western Washington University. The magazine was established in 1977 by the poets Knute Skinner and Peter Nicoletta. \" The Bellingham Review\" includes fiction, poetry, and creative non-fiction. The current editor is writer Susanne Paola Antonetta. Work that has appeared in the \"Bellingham Review\" has been reprinted in \"The Pushcart Prize Anthology\" and \"The Best American Poetry\". Notable contributors include: Micah Nathan, Jenna Blum, Anne Panning, Sheila Bender, and Deborah A. Miranda. Western Washington University (WWU or Western) is a public university in Bellingham, Washington. It is the northernmost university in the contiguous United States and was founded as the state-funded New Whatcom Normal School in 1893, succeeding a private school of teaching for women. WWU offers a variety of bachelor's and master's degrees. In 2018, there were 16,121 students, 15,170 of whom were undergraduate students, and 639 faculty. Its athletic teams are known as the Vikings, which compete in division II of the National Collegiate Athletic Association. Western Washington University was founded in 1886, initially as Northwest Normal School for teachers, and was first located in Lynden, Washington. After moving to Bellingham and undergoing a series of name changes, the school became Western Washington College of Education in 1937. The same year, the school became a four-year college. In 1977, the school gained university status, becoming Western Washington University.", "reasoning_type": "Arithmetic"}}
